alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_common/rtl8721d_sgpio.c
/**
  ******************************************************************************
  * @file    rtl8721dlp_sgpio.c
  * @author
  * @version V1.0.0
  * @date    2017-10-16
  * @brief   This file provides firmware rom patch functions to manage clk 
  ******************************************************************************
  * @attention
  *
  * This module is a confidential and proprietary property of RealTek and
  * possession or use of this module requires written permission of RealTek.
  *
  * Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
  ****************************************************************************** 
  */

#include "ameba_soc.h"
#include "rtl8721d_sgpio.h"
/**
  * @brief  Fills each SGPIO_RXInitStruct member with its default value.
  * @param  SGPIO_RXInitStruct: pointer to an SGPIO_RXInitTypeDef structure which will be initialized.
  * @retval None
  */
void SGPIO_RX_StructInit(SGPIO_RXInitTypeDef* SGPIO_RXInitStruct)
{
	/* Load HAL initial data structure default value */
	SGPIO_RXInitStruct->RxDataSrc_Sel = RX_DATA_SRC_EXTERNAL_INPUT;
	SGPIO_RXInitStruct->RxTimerEdge_Sel = RX_TIMER_RISING_EDGE;
	SGPIO_RXInitStruct->RxPRVal = (2-1);
	SGPIO_RXInitStruct->RxPRTC = 0x0;
	SGPIO_RXInitStruct->RxTC = 0x0;
	SGPIO_RXInitStruct->RxData = 0x0;
	SGPIO_RXInitStruct->RxData_DP = 0x0;
	SGPIO_RXInitStruct->RxData_Dir = RX_DATA_DIR_MSB;
	SGPIO_RXInitStruct->RxPosTC = (8-1);
}

/**
  * @brief  Initializes the SGPIOx peripheral according to the specified 
  *			parameters in the SGPIO_RXInitTypeDef.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXInitStruct: pointer to a SGPIO_RXInitTypeDef structure that contains
  * 		the configuration information for the specified SGPIO peripheral.
  * @retval None
  */
void SGPIO_RX_Init(SGPIO_TypeDef *SGPIOx, SGPIO_RXInitTypeDef* SGPIO_RXInitStruct)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(IS_RX_DATA_SRC(SGPIO_RXInitStruct->RxDataSrc_Sel));
	assert_param(IS_RX_TIMER_TRIGGER_MODE(SGPIO_RXInitStruct->RxTimerEdge_Sel));
	assert_param(SGPIO_RXInitStruct->RxPRVal <= 0xffff);
	assert_param(SGPIO_RXInitStruct->RxPRTC <= 0xffff);
	assert_param(SGPIO_RXInitStruct->RxTC <= 0xffff);
	assert_param(SGPIO_RXInitStruct->RxPosTC <= 0x1f);
	assert_param(IS_RX_DATA_DIR(SGPIO_RXInitStruct->RxData_Dir));

	/* Mask all interrupt */
	SGPIOx->SGPIO_IMR |= BIT_SGPIO_INTR_MASK;

	/* Disable the SGPIO RX Timer and RX Prescale Timer*/
	SGPIOx->SGPIO_RXTMR_CTRL &= (~BIT_SGPIO_RXTMR_CEN);
	
	/*Avoid clock domain crossing issue*/
	while(SGPIOx->SGPIO_RXTMR_CTRL & BIT_SGPIO_RXTMR_CEN) {
	}
		
	/* Set RX Timer Trigger Mode */
	TempVal = SGPIOx->SGPIO_RXTMR_CTRL;
	TempVal &= (~BIT_SGPIO_RXTMREDGE_SEL);
	TempVal |= SGPIO_RXInitStruct->RxTimerEdge_Sel;
	SGPIOx->SGPIO_RXTMR_CTRL = TempVal;

	SGPIOx->SGPIO_RXPRVAL = SGPIO_RXInitStruct->RxPRVal;
	SGPIOx->SGPIO_RXPRTC = SGPIO_RXInitStruct->RxPRTC;
	SGPIOx->SGPIO_RXTC = SGPIO_RXInitStruct->RxPRTC;

	/* Set RX Data Source */
	TempVal = SGPIOx->SGPIO_DATA_CTRL;
	TempVal &= (~BIT_SGPIO_RXDATASRC_SEL);
	TempVal |= SGPIO_RXInitStruct->RxDataSrc_Sel;
	SGPIOx->SGPIO_DATA_CTRL = TempVal;

	/* Set RX Data Direction */
	TempVal = SGPIOx->SGPIO_DATA_CTRL;
	TempVal &= (~BIT_SGPIO_RXDATA_DIR);
	TempVal |= SGPIO_RXInitStruct->RxData_Dir;
	SGPIOx->SGPIO_DATA_CTRL = TempVal;

	SGPIOx->SGPIO_RXPOSR = SGPIO_RXInitStruct->RxPosTC;

	/* Unmask all interrupt */
	SGPIOx->SGPIO_IMR &= (~BIT_SGPIO_INTR_MASK);

}

/**
  * @brief  Set the Multiple Timer control when RXMR0 matches RXTC.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXMR0Val: specifies the value of SGPIO RX Match 0 Register.
  * @param  SGPIO_RXMR0MULCtl: specifies the control of MULTC when RXMR0 matches RXTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_RX_MR0MULRST_EN: Reset MULTC .
  *            @arg BIT_SGPIO_RX_MR0MULSTOP_EN: MULTC will stop and MULTMR_CEN will be cleared.
  * @retval None
  */
void SGPIO_RXMR0MULConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_RXMR0Val, u32 SGPIO_RXMR0MULCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_RXMR0Val <= 0xffff);

	SGPIOx->SGPIO_RXMR0 = SGPIO_RXMR0Val;

	TempVal = SGPIOx->SGPIO_RXMC_CTRL;
	TempVal &= (~BIT_SGPIO_RX_MR0MUL_CTRL);
	TempVal |= SGPIO_RXMR0MULCtl;
	SGPIOx->SGPIO_RXMC_CTRL = TempVal;
}

/**
  * @brief  Get RX Data from rx data duplicate register.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @retval   RX Data in duplicate register
  */
u32 SGPIO_GetRXData(SGPIO_TypeDef *SGPIOx)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	return SGPIOx->SGPIO_RXDATA_DP;
}

/**
  * @brief  Set the reload value of RXPOSTC and control of RXTC.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_PosRstVal: specifies the reload value of RXPOSTC.
  * @param  SGPIO_RXPOSCtl: specifies the control of RXTC when RXPOSTC reaches 0.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_RX_POSRST_EN: Reset RXTC .
  *            @arg BIT_SGPIO_RX_POSSTOP_EN: RXTC will stop and MULTMR_CEN will be cleared.
  * @retval None
  */
void SGPIO_RXPosConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_PosRstVal, u32 SGPIO_RXPOSCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_PosRstVal <= 0x1f);

	TempVal = SGPIOx->SGPIO_RXMC_CTRL;
	TempVal &= (~BIT_SGPIO_RX_POS_CTRL);
	TempVal |= SGPIO_RXPOSCtl;
	SGPIOx->SGPIO_RXMC_CTRL = TempVal;

	TempVal = SGPIOx->SGPIO_RXPOSR;
	TempVal &= (~BIT_SGPIO_RXPOSRST);
	TempVal |= (SGPIO_PosRstVal << 8);
	SGPIOx->SGPIO_RXPOSR = TempVal;
}

/**
  * @brief  Set the SGPIO RXMR0.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXMR0Val: specifies the value of SGPIO RX Match 0 Register.
  * @param  SGPIO_RXMR0Ctl: specifies the control of RXTC when RXMR0 matches RXTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_RX_MR0_IE: Generate an interrupt .
  *            @arg BIT_SGPIO_RX_MR0RST_EN: Reset RXTC .
  *            @arg BIT_SGPIO_RX_MR0STOP_EN: RXTC will stop and RXTMR_CEN will be cleared.
  *            @arg BIT_SGPIO_RX_MR0SCLK_EN: Generate a shift clock for RX Data Register.
  * @retval None
  */
void SGPIO_RXMR0Config(SGPIO_TypeDef *SGPIOx, u32 SGPIO_RXMR0Val, u32 SGPIO_RXMR0Ctl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_RXMR0Val <= 0xffff);

	SGPIOx->SGPIO_RXMR0 = SGPIO_RXMR0Val;

