alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_common/rtl8721d_sgpio.c
	TempVal = SGPIOx->SGPIO_RXMC_CTRL;
	TempVal &= (~BIT_SGPIO_RX_MR0_CTRL);
	TempVal |= SGPIO_RXMR0Ctl;
	SGPIOx->SGPIO_RXMC_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO RXMR1.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXMR1Val: specifies the value of SGPIO RX Match 1 Register.
  * @param  SGPIO_RXMR1Ctl: specifies the control of RXTC when RXMR1 matches RXTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_RX_MR1_IE: Generate an interrupt .
  *            @arg BIT_SGPIO_RX_MR1RST_EN: Reset RXTC .
  *            @arg BIT_SGPIO_RX_MR1STOP_EN: RXTC will stop and RXTMR_CEN will be cleared.
  *            @arg BIT_SGPIO_RX_MR1SCLK_EN: Generate a shift clock for RX Data Register.
  * @retval None
  */
void SGPIO_RXMR1Config(SGPIO_TypeDef *SGPIOx, u32 SGPIO_RXMR1Val, u32 SGPIO_RXMR1Ctl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_RXMR1Val <= 0xffff);

	SGPIOx->SGPIO_RXMR1 = SGPIO_RXMR1Val;

	TempVal = SGPIOx->SGPIO_RXMC_CTRL;
	TempVal &= (~BIT_SGPIO_RX_MR1_CTRL);
	TempVal |= SGPIO_RXMR1Ctl;
	SGPIOx->SGPIO_RXMC_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO RXMR2.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXMR2Val: specifies the value of SGPIO RX Match 2 Register.
  * @param  SGPIO_RXMR2Ctl: specifies the control of RXTC when RXMR0 matches RXTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_RX_MR2_IE: Generate an interrupt .
  *            @arg BIT_SGPIO_RX_MR2RST_EN: Reset RXTC .
  *            @arg BIT_SGPIO_RX_MR2STOP_EN: RXTC will stop and RXTMR_CEN will be cleared.
  *            @arg BIT_SGPIO_RX_MR2SCLK_EN: Generate a shift clock for RX Data Register.
  * @retval None
  */
void SGPIO_RXMR2Config(SGPIO_TypeDef *SGPIOx, u32 SGPIO_RXMR2Val, u32 SGPIO_RXMR2Ctl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_RXMR2Val <= 0xffff);

	SGPIOx->SGPIO_RXMR2 = SGPIO_RXMR2Val;

	TempVal = SGPIOx->SGPIO_RXMC_CTRL;
	TempVal &= (~BIT_SGPIO_RX_MR2_CTRL);
	TempVal |= SGPIO_RXMR2Ctl;
	SGPIOx->SGPIO_RXMC_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO RX Match Register Output control.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_RXMR0TXCtl: specifies the output control when RXMR0 matches RXTC.
  *          This parameter can be a value of @ref RXMR0_Output_Control_Options
  * @param  SGPIO_RXMR1TXCtl: specifies the output control when RXMR1 matches RXTC.
  *          This parameter can be a value of @ref RXMR1_Output_Control_Options
  * @param  SGPIO_RXMR2TXCtl: specifies the output control when RXMR2 matches RXTC. 
  *          This parameter can be a value of @ref RXMR2_Output_Control_Options
  * @retval None
  */
void SGPIO_RXMRxTXConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_RXMR0TXCtl, u32 SGPIO_RXMR1TXCtl, u32 SGPIO_RXMR2TXCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(IS_RXMR0_OUTCTRL_OPTION(SGPIO_RXMR0TXCtl));
	assert_param(IS_RXMR1_OUTCTRL_OPTION(SGPIO_RXMR1TXCtl));
	assert_param(IS_RXMR2_OUTCTRL_OPTION(SGPIO_RXMR2TXCtl));

	TempVal = SGPIOx->SGPIO_MULEMR;
	TempVal &= (~BIT_SGPIO_RXEMC_CTRL);
	TempVal |= (SGPIO_RXMR0TXCtl | SGPIO_RXMR1TXCtl | SGPIO_RXMR2TXCtl);
	SGPIOx->SGPIO_MULEMR = TempVal;
}


/**
  * @brief  Reset the SGPIO RX Timer and RX Prescale Timer.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @retval None
  */
void SGPIO_RXTmr_Reset(SGPIO_TypeDef *SGPIOx)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	/* Reset the SGPIO RX Timer and RX Prescale Timer*/
	SGPIOx->SGPIO_RXTMR_CTRL |= BIT_SGPIO_RXTMR_CRST;
}

/**
  * @brief  Enables or disables the SGPIO RX Timer and RX Prescale Timer.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the RX Timer and RX Prescale Timer. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_RXTmr_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		/* Enable the SGPIO RX Timer and RX Prescale Timer*/
		SGPIOx->SGPIO_RXTMR_CTRL |= BIT_SGPIO_RXTMR_CEN;

		/*Avoid clock domain crossing issue*/
		while(!(SGPIOx->SGPIO_RXTMR_CTRL & BIT_SGPIO_RXTMR_CEN)) {
		}
	} else {
		/* Disable the SGPIO RX Timer and RX Prescale Timer*/
		SGPIOx->SGPIO_RXTMR_CTRL &= (~BIT_SGPIO_RXTMR_CEN);

		/*Avoid clock domain crossing issue*/
		while(SGPIOx->SGPIO_RXTMR_CTRL & BIT_SGPIO_RXTMR_CEN) {
		}
	}
}

/**
  * @brief  Set RX Pattern Match Mode.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  RXDATADP: the specific value of RXDATA match pattern should be set.
  * @param  RXDATAMask: mask for pattern match function. 
  * @param  NewState: new state of the patten match function. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_RXPatternMatchConfig(SGPIO_TypeDef *SGPIOx, u32 RXDATADP, u32 RXDATAMask, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		SGPIOx->SGPIO_RXDATAMASK = RXDATAMask & BIT_SGPIO_RXDATAMASK;

		SGPIOx->SGPIO_RXDATA_DP = RXDATADP;
		/* Enable the patten match function*/
		SGPIOx->SGPIO_DATA_CTRL |= BIT_SGPIO_PATTERN_MATCH_MODE;
	} else {
		/* Disable the patten match function*/
		SGPIOx->SGPIO_DATA_CTRL &= (~BIT_SGPIO_PATTERN_MATCH_MODE);
	}
}

/**
  * @brief  Fills each SGPIO_MULInitStruct member with its default value.
  * @param  SGPIO_MULInitStruct: pointer to an SGPIO_MULInitTypeDef structure which will be initialized.
  * @retval None
  */
void SGPIO_MUL_StructInit(SGPIO_MULInitTypeDef* SGPIO_MULInitStruct)
{
	/* Load HAL initial data structure default value */
	SGPIO_MULInitStruct->BiOut = MUL_DISABLE_BIOUT;
	SGPIO_MULInitStruct->MulMode_Sel = MUL_TIMER_MODE;
	SGPIO_MULInitStruct->MulPRVal = (2-1);
	SGPIO_MULInitStruct->MulPRTC = 0x0;
	SGPIO_MULInitStruct->MulTC = 0x0;
	SGPIO_MULInitStruct->MulData_Dir = MUL_DATA_DIR_LSB;
	SGPIO_MULInitStruct->MulPosTC = (8-1);
	SGPIO_MULInitStruct->MulPosRST = (8-1);
}

/**
  * @brief  Initializes the SGPIOx peripheral according to the specified 
  *			parameters in the SGPIO_MULInitTypeDef.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULInitStruct: pointer to a SGPIO_MULInitTypeDef structure that contains
  * 		the configuration information for the specified SGPIO peripheral.
  * @retval None
  */
void SGPIO_MUL_Init(SGPIO_TypeDef *SGPIOx, SGPIO_MULInitTypeDef* SGPIO_MULInitStruct)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(IS_MUL_BIOUT_MODE(SGPIO_MULInitStruct->BiOut));
	assert_param(IS_MUL_MODE(SGPIO_MULInitStruct->MulMode_Sel));
	assert_param(SGPIO_MULInitStruct->MulPRVal <= 0xffff);
	assert_param(SGPIO_MULInitStruct->MulPRTC <= 0xffff);
	assert_param(SGPIO_MULInitStruct->MulTC <= 0xffff);
	assert_param(SGPIO_MULInitStruct->MulPosTC <= 0x1f);
	assert_param(SGPIO_MULInitStruct->MulPosRST <= 0x1f);	
	assert_param(IS_MUL_DATA_DIR(SGPIO_MULInitStruct->MulData_Dir));

	/* Mask all interrupt */
	SGPIOx->SGPIO_IMR |= BIT_SGPIO_INTR_MASK;

	/* Disable the SGPIO Multiple Timer and Multiple Prescale Timer*/
	SGPIOx->SGPIO_MULTMR_CTRL &= (~BIT_SGPIO_MULTMR_CEN);

	/*Avoid clock domain crossing issue*/
	while(SGPIOx->SGPIO_MULTMR_CTRL & BIT_SGPIO_MULTMR_CEN) {
	}
	
	/* Set Multiple Timer TX pin */
	TempVal = SGPIOx->SGPIO_MULEMR;
	TempVal &= (~BIT_SGPIO_BIOUT);
	TempVal |= SGPIO_MULInitStruct->BiOut;
	SGPIOx->SGPIO_MULEMR = TempVal;
	
