alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_common/rtl8721d_sgpio.c
	/* Set Multiple Timer Work Mode */
	TempVal = SGPIOx->SGPIO_MULTMR_CTRL;
	TempVal &= (~BIT_SGPIO_MULMODE_SEL);
	TempVal |= SGPIO_MULInitStruct->MulMode_Sel;
	SGPIOx->SGPIO_MULTMR_CTRL = TempVal;

	SGPIOx->SGPIO_MULPRVAL = SGPIO_MULInitStruct->MulPRVal;
	SGPIOx->SGPIO_MULPRTC = SGPIO_MULInitStruct->MulPRTC;
	SGPIOx->SGPIO_MULTC = SGPIO_MULInitStruct->MulPRTC;

	/* Set MUL Data Direction */
	TempVal = SGPIOx->SGPIO_DATA_CTRL;
	TempVal &= (~BIT_SGPIO_TXDATA_DIR);
	TempVal |= SGPIO_MULInitStruct->MulData_Dir;
	SGPIOx->SGPIO_DATA_CTRL = TempVal;

	SGPIOx->SGPIO_MULPOSR = (SGPIO_MULInitStruct->MulPosRST << 8) |SGPIO_MULInitStruct->MulPosTC;

	/* Unmask all interrupt */
	SGPIOx->SGPIO_IMR &= (~BIT_SGPIO_INTR_MASK);
}


/**
  * @brief  Set the SGPIO MULMR0.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMR0Val0: specifies the value of MULMR0 when TXDATA[0] is 0.
  * @param  SGPIO_MULMR0Val1: specifies the value of MULMR0 when TXDATA[0] is 1.
  * @param  SGPIO_MULMR0Ctl: specifies the control of MULTC when MULMR0 matches MULTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg NULL: No control.
  *            @arg BIT_SGPIO_MUL_MR0_IE: Generate an interrupt.
  *            @arg BIT_SGPIO_MUL_MR0RST_EN: Reset MULTC.
  *            @arg BIT_SGPIO_MUL_MR0STOP_EN: MULTC will stop and MULTMR_CEN will be cleared.
  *            @arg BIT_SGPIO_MUL_MR0SCLK_EN: Generate a shift clock for Multiple Data Register.
  * @retval None
  */
void SGPIO_MULMR0MulConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMR0Val0, u32 SGPIO_MULMR0Val1, u32 SGPIO_MULMR0Ctl)
{
	u32 TempVal;
	
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MULMR0Val0 <= 0xffff);
	assert_param(SGPIO_MULMR0Val1 <= 0xffff);

	TempVal = SGPIOx->SGPIO_MULMR01GP0;
	TempVal &= (~BIT_SGPIO_MULMR0_GP0);
	TempVal |= SGPIO_MULMR0Val0;
	SGPIOx->SGPIO_MULMR01GP0 = TempVal;

	TempVal = SGPIOx->SGPIO_MULMR01GP1;
	TempVal &= (~BIT_SGPIO_MULMR0_GP1);
	TempVal |= SGPIO_MULMR0Val1;
	SGPIOx->SGPIO_MULMR01GP1 = TempVal;

	TempVal = SGPIOx->SGPIO_MULMC_CTRL;
	TempVal &= (~BIT_SGPIO_MUL_MR0_CTRL);
	TempVal |= SGPIO_MULMR0Ctl;
	SGPIOx->SGPIO_MULMC_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO MULMR0 and control of RXTC.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMR0Val0: specifies the value of MULMR0 when TXDATA[0] is 0.
  * @param  SGPIO_MULMR0Val1: specifies the value of MULMR0 when TXDATA[0] is 1.
  * @param  SGPIO_MULMR0RXCtl: specifies the control of RXTC when MULMR0 matches MULTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_MUL_MR0RXRST_EN: Reset RXTC .
  *            @arg BIT_SGPIO_MUL_MR0RXSTOP_EN: RXTC will stop and RXTMR_CEN will be cleared.
  * @retval None
  */
void SGPIO_MULMR0RXConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMR0Val0, u32 SGPIO_MULMR0Val1, u32 SGPIO_MULMR0RXCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MULMR0Val0 <= 0xffff);
	assert_param(SGPIO_MULMR0Val1 <= 0xffff);

	TempVal = SGPIOx->SGPIO_MULMR01GP0;
	TempVal &= (~BIT_SGPIO_MULMR0_GP0);
	TempVal |= SGPIO_MULMR0Val0;
	SGPIOx->SGPIO_MULMR01GP0 = TempVal;

	TempVal = SGPIOx->SGPIO_MULMR01GP1;
	TempVal &= (~BIT_SGPIO_MULMR0_GP1);
	TempVal |= SGPIO_MULMR0Val1;
	SGPIOx->SGPIO_MULMR01GP1 = TempVal;

	TempVal = SGPIOx->SGPIO_MULMC_CTRL;
	TempVal &= (~BIT_SGPIO_MUL_MR0RX_CTRL);
	TempVal |= SGPIO_MULMR0RXCtl;
	SGPIOx->SGPIO_MULMC_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO MULMRx register for group 0.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMR0GP0: specifies the value of MULMR0 when TXDATA[0] is 0.
  * @param  SGPIO_MULMR1GP0: specifies the value of MULMR1 when TXDATA[0] is 0.
  * @param  SGPIO_MULMR2GP0: specifies the value of MULMR2 when TXDATA[0] is 0.
  * @param  SGPIO_MULMR3GP0: specifies the value of MULMR3 when TXDATA[0] is 0.
  * @retval None
  */
void SGPIO_MULMRxGP0ValConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMR0GP0, u32 SGPIO_MULMR1GP0, u32 SGPIO_MULMR2GP0, u32 SGPIO_MULMR3GP0)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MULMR0GP0 <= 0xffff);
	assert_param(SGPIO_MULMR1GP0 <= 0xffff);
	assert_param(SGPIO_MULMR2GP0 <= 0xffff);
	assert_param(SGPIO_MULMR3GP0 <= 0xffff);

	SGPIOx->SGPIO_MULMR01GP0 = (SGPIO_MULMR1GP0 << 16) | SGPIO_MULMR0GP0;
	SGPIOx->SGPIO_MULMR23GP0 = (SGPIO_MULMR3GP0 << 16) | SGPIO_MULMR2GP0;
}

/**
  * @brief  Set the SGPIO MULMRx register for group 1.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMR0GP1: specifies the value of MULMR0 when TXDATA[0] is 1.
  * @param  SGPIO_MULMR1GP1: specifies the value of MULMR1 when TXDATA[0] is 1.
  * @param  SGPIO_MULMR2GP1: specifies the value of MULMR2 when TXDATA[0] is 1.
  * @param  SGPIO_MULMR3GP1: specifies the value of MULMR3 when TXDATA[0] is 1.
  * @retval None
  */
void SGPIO_MULMRxGP1ValConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMR0GP1, u32 SGPIO_MULMR1GP1, u32 SGPIO_MULMR2GP1, u32 SGPIO_MULMR3GP1)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MULMR0GP1 <= 0xffff);
	assert_param(SGPIO_MULMR1GP1 <= 0xffff);
	assert_param(SGPIO_MULMR2GP1 <= 0xffff);
	assert_param(SGPIO_MULMR3GP1 <= 0xffff);

	SGPIOx->SGPIO_MULMR01GP1 = (SGPIO_MULMR1GP1 << 16) | SGPIO_MULMR0GP1;
	SGPIOx->SGPIO_MULMR23GP1 = (SGPIO_MULMR3GP1 << 16) | SGPIO_MULMR2GP1;
}

/**
  * @brief  Set the SGPIO MULMRx control.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMR0TXCtl: specifies the control of MULTC when MULMR0 matches MULTC.
  *          This parameter can be one or combinations of the following values:
  *            @arg NULL: No control.
  *            @arg BIT_SGPIO_MUL_MR0_IE: Generate an interrupt.
  *            @arg BIT_SGPIO_MUL_MR0RST_EN: Reset MULTC.
  *            @arg BIT_SGPIO_MUL_MR0STOP_EN: MULTC will stop and MULTMR_CEN will be cleared.
  *            @arg BIT_SGPIO_MUL_MR0SCLK_EN: Generate a shift clock for Multiple Data Register.
  * @param  SGPIO_MULMR1TXCtl: specifies the output control when MULMR1 matches MULTC.
  *          This parameter can be a value of @ref MULMR1_Output_Control_Option
  * @param  SGPIO_MULMR2TXCtl: specifies the output control when MULMR2 matches MULTC.
  *          This parameter can be a value of @ref MULMR2_Output_Control_Option
  * @param  SGPIO_MULMR3TXCtl: specifies the output control when MULMR3 matches MULTC.
  *          This parameter can be a value of @ref MULMR3_Output_Control_Option
  * @retval None
  */
void SGPIO_MULMRxTXCtlConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMR0TXCtl, u32 SGPIO_MULMR1TXCtl, u32 SGPIO_MULMR2TXCtl, u32 SGPIO_MULMR3TXCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(IS_MULMR1_OUTCTRL_OPTION(SGPIO_MULMR1TXCtl));
	assert_param(IS_MULMR2_OUTCTRL_OPTION(SGPIO_MULMR2TXCtl));
	assert_param(IS_MULMR3_OUTCTRL_OPTION(SGPIO_MULMR3TXCtl));

	/*set MULMR0 control*/
	TempVal = SGPIOx->SGPIO_MULMC_CTRL;
	TempVal &= (~BIT_SGPIO_MUL_MR0_CTRL);
	TempVal |= SGPIO_MULMR0TXCtl;
	SGPIOx->SGPIO_MULMC_CTRL = TempVal;

	/*set MULMRx output control*/
	TempVal = SGPIOx->SGPIO_MULEMR;
	TempVal &= (~(BIT_SGPIO_MULEMC1 | BIT_SGPIO_MULEMC2 | BIT_SGPIO_MULEMC3));
	TempVal |= (SGPIO_MULMR1TXCtl | SGPIO_MULMR2TXCtl | SGPIO_MULMR3TXCtl);
	SGPIOx->SGPIO_MULEMR = TempVal;
}

/**
  * @brief  Set TX Data to multiple data register.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MulDataVal: specifies the value of SGPIO_MULDATA
  * @param  SGPIO_MulDataDPVal: specifies the reload value of SGPIO_MULDATA
  * @retval None
  */
void SGPIO_SetTXData(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MulDataVal, u32 SGPIO_MulDataDPVal)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MulDataVal <= 0xffffffff);
	assert_param(SGPIO_MulDataDPVal <= 0xffffffff);

	SGPIOx->SGPIO_MULDATA = SGPIO_MulDataVal;
	SGPIOx->SGPIO_MULDATA_DP = SGPIO_MulDataDPVal;
}

/**
  * @brief  Config output level.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_OutputCtl: specifies the value of SGPIO_OUTPUT
  *          This parameter can be one of the following values:
  *            @arg BIT_SGPIO_OUTPUT_LOW: output low.
  *            @arg BIT_SGPIO_OUTPUT_HIGH: output high.
  * @retval None
  */
void SGPIO_OutputConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_OutputCtl)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	SGPIOx->SGPIO_OUTPUT = SGPIO_OutputCtl;
}

/** 
  * @brief  Reset the SGPIO Multiple Timer and Multiple Prescale Timer.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @retval None
  */
void SGPIO_MULTmr_Reset(SGPIO_TypeDef *SGPIOx)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	/* Reset the SGPIO Multiple Timer and Multiple Prescale Timer*/
	SGPIOx->SGPIO_MULTMR_CTRL |= BIT_SGPIO_MULTMR_CRST;
}

/**
  * @brief  Enables or disables the SGPIO Multiple Timer and Multiple Prescale Timer.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the Multiple Timer and Multiple Prescale Timer. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_MULTmr_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

