alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_common/rtl8721d_sgpio.c
	if (NewState != DISABLE) {
		/* Enable the SGPIO Multiple Timer and Multiple Prescale Timer*/
		SGPIOx->SGPIO_MULTMR_CTRL |= BIT_SGPIO_MULTMR_CEN;

		/*Avoid clock domain crossing issue*/
		while(!(SGPIOx->SGPIO_MULTMR_CTRL & BIT_SGPIO_MULTMR_CEN)) {
		}
	} else {
		/* Disable the SGPIO Multiple Timer and Multiple Prescale Timer*/
		SGPIOx->SGPIO_MULTMR_CTRL &= (~BIT_SGPIO_MULTMR_CEN);

		/*Avoid clock domain crossing issue*/
		while(SGPIOx->SGPIO_MULTMR_CTRL & BIT_SGPIO_MULTMR_CEN) {
		}
	}
}

/**
  * @brief  Set the SGPIO MULMR0.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULMCNTVal: specifies the value of MUL_MCNT.
  * @param  SGPIO_MULMR0Ctl: specifies the control of MULTC when MUL_MCNT reaches zero.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_MUL_MCNT_IE: Generate an interrupt .
  *            @arg BIT_SGPIO_MUL_MCNTRST_EN: Reset MULTC .
  *            @arg BIT_SGPIO_MUL_MCNTSTOP_EN: MULTC will stop and MULTMR_CEN will be cleared.
  * @retval None
  */
void SGPIO_MULMCNTConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULMCNTVal, u32 SGPIO_MULMCNTCtl)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(SGPIO_MULMCNTVal <= 0xff);

	SGPIOx->SGPIO_MUL_MCNT = SGPIO_MULMCNTVal;

	TempVal = SGPIOx->SGPIO_MULMC_CTRL;
	TempVal &= (~BIT_SGPIO_MUL_MCNT_CTRL);
	TempVal |= SGPIO_MULMCNTCtl;
	SGPIOx->SGPIO_MULMC_CTRL = TempVal;
}

/**
  * @brief  Enables or disables the SGPIO MCNT function.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the MCNT function. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_MULMCNT_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		/* Enable the SGPIO MCNT function*/
		SGPIOx->SGPIO_MULMC_CTRL |= BIT_SGPIO_MUL_MR0MCNT_EN;
	} else {
		/* Disable the SGPIO MCNT function*/
		SGPIOx->SGPIO_MULMC_CTRL &= (~BIT_SGPIO_MUL_MR0MCNT_EN);
	}
}

/**
  * @brief  Fills each SGPIO_CAPInitStruct member with its default value.
  * @param  SGPIO_CAPInitStruct: pointer to an SGPIO_CAPInitTypeDef structure which will be initialized.
  * @retval None
  */
void SGPIO_CAP_StructInit(SGPIO_CAPInitTypeDef* SGPIO_CAPInitStruct)
{
	/* Load HAL initial data structure default value */
	SGPIO_CAPInitStruct->CapSrc_Sel = CAPSRC_RX_INPUT;
	SGPIO_CAPInitStruct->CapEdge_Sel = CAP_RX_FALLING_EDGE;
	SGPIO_CAPInitStruct->Cap_ValidEn = CAP_RX_VALID_ENABLE;
	SGPIO_CAPInitStruct->Cap_RxTCStop_Ctrl = CAP_RX_STOP_ENABLE;
	SGPIO_CAPInitStruct->Cap_RxTCRst_Ctrl = CAP_RX_RESET_ENABLE;
	SGPIO_CAPInitStruct->CapI_En = CAP_INTR_ENABLE;
}

/**
  * @brief  Initializes the SGPIOx peripheral according to the specified 
  *			parameters in the SGPIO_CAPInitTypeDef.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_CAPInitStruct: pointer to a SGPIO_CAPInitTypeDef structure that contains
  * 		the configuration information for the specified SGPIO peripheral.
  * @retval None
  */
void SGPIO_CAP_Init(SGPIO_TypeDef *SGPIOx, SGPIO_CAPInitTypeDef* SGPIO_CAPInitStruct)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(IS_CAPSRC_SEL_OPTION(SGPIO_CAPInitStruct->CapSrc_Sel));
	assert_param(IS_CAPEDGE_SEL_OPTION(SGPIO_CAPInitStruct->CapEdge_Sel));
	assert_param(IS_CAP_RX_VALID_OPTION(SGPIO_CAPInitStruct->Cap_ValidEn));
	assert_param(IS_CAP_RX_STOP_OPTION(SGPIO_CAPInitStruct->Cap_RxTCStop_Ctrl));
	assert_param(IS_CAP_RX_RESET_OPTION(SGPIO_CAPInitStruct->Cap_RxTCRst_Ctrl));
	assert_param(IS_CAP_INTR_OPTION(SGPIO_CAPInitStruct->CapI_En));

	TempVal = SGPIOx->SGPIO_CAP_CTRL;
	TempVal &= (~(BIT_SGPIO_CAPVALID_EN | BIT_SGPIO_CAP_RXTCSTOP_EN | BIT_SGPIO_CAP_RXTCRST_EN |\
		BIT_SGPIO_CAP_RXEDGE_SEL | BIT_SGPIO_CAPSRC_SEL | BIT_SGPIO_CAP_IE));

	if (CAPSRC_RX_INPUT == SGPIO_CAPInitStruct->CapSrc_Sel) {
		TempVal |= (SGPIO_CAPInitStruct->CapSrc_Sel | SGPIO_CAPInitStruct->CapEdge_Sel);
	} else {
		TempVal |= SGPIO_CAPInitStruct->CapSrc_Sel;
		SGPIOx->SGPIO_MULMC_CTRL |= BIT_SGPIO_MUL_MR0CAPSRC_EN;
	}

	TempVal |= (SGPIO_CAPInitStruct->Cap_ValidEn | SGPIO_CAPInitStruct->Cap_RxTCStop_Ctrl |\
		SGPIO_CAPInitStruct->Cap_RxTCRst_Ctrl | SGPIO_CAPInitStruct->CapI_En);
	
	SGPIOx->SGPIO_CAP_CTRL = TempVal;
}

/**
  * @brief  Get SGPIO RX timer counter capture value.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @retval RX timer counter capture Value
  */
u32 SGPIO_GetCapVal(SGPIO_TypeDef *SGPIOx)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	
	return SGPIOx->SGPIO_CAPR;
}

/**
  * @brief  set SGPIO Capture compare function.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  CapComp_Val: compare this value with CAPR. 
  * @param  CapComp_Mode: RXDATA receives value set when CAPR is bigger than CapComp_Val. 
  *   This parameter can be a value of @ref Cap_CmpVal_Sel_definitions.
  * @retval None
  */
void SGPIO_Cap_CompConfig(SGPIO_TypeDef *SGPIOx, u32 CapComp_Val, u32 CapComp_Mode)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	assert_param(CapComp_Val <= 0xffff);
	assert_param(IS_CAP_CMPVAL_SEL_OPTION(CapComp_Mode));

	TempVal = SGPIOx->SGPIO_CAP_CTRL;
	TempVal &= (~(BIT_SGPIO_CAP_CMPVAL | BIT_SGPIO_CAP_CMPVAL_SEL));
	TempVal |= ((CapComp_Val << 16) | CapComp_Mode);
	SGPIOx->SGPIO_CAP_CTRL = TempVal;
}

/**
  * @brief  Enables or disables the SGPIO Capture Function.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the Capture function. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_Cap_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		/* Enable the CAPR load with RXTC when there is an event*/
		SGPIOx->SGPIO_CAP_CTRL |= BIT_SGPIO_CAP_EN;
	} else {
		/* Disable the CAPR load with RXTC when there is an event*/
		SGPIOx->SGPIO_CAP_CTRL &= (~BIT_SGPIO_CAP_EN);
	}
}

/**
  * @brief  Set the SGPIO Interrupt Enable.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_IT: specifies the SGPIO interrupt sources to be enabled or disabled.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_PATTERN_MATCH_IE: Matching pattern Interrupt Enable.
  *            @arg BIT_SGPIO_MULLOAD_IE: Loading multiple data Interrupt Enable.
  *            @arg BIT_SGPIO_RXLOAD_IE: Loading RX data Interrupt Enable.
  *            @arg BIT_SGPIO_MULSFT_IE: Multiple shift clock Interrupt Enable.
  *            @arg BIT_SGPIO_RXSFT_IE: RX shift clock Interrupt Enable.
  * @param  NewState: specifies the state of the interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_INTConfig(SGPIO_TypeDef *SGPIOx, u32 SGPIO_IT, u32 NewState)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

