alibaba/AliOS-Things/hardware/chip/rtl872xd/sdk/component/soc/realtek/amebad/fwlib/ram_common/rtl8721d_sgpio.c
	TempVal = SGPIOx->SGPIO_DATA_CTRL;

	if (NewState == ENABLE) {
		TempVal |= SGPIO_IT;
	} else {
		TempVal &= (~SGPIO_IT);
	}

	SGPIOx->SGPIO_DATA_CTRL = TempVal;
}

/**
  * @brief  Set the SGPIO Interrupt Mask.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_IT: specifies the SGPIO Interrupt sources to be masked or not.
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_MULMCNT_IM: MUL_MCNT counts to zero Interrupt Mask.
  *            @arg BIT_SGPIO_PATTERN_MATCH_IM: Matching pattern Interrupt Mask.
  *            @arg BIT_SGPIO_MULLOAD_IM: Loading multiple data Interrupt Mask.
  *            @arg BIT_SGPIO_RXLOAD_IM: Loading RX data Interrupt Mask.
  *            @arg BIT_SGPIO_MULSFT_IM: Multiple shift clock Interrupt Mask.
  *            @arg BIT_SGPIO_RXSFT_IM: RX shift clock Interrupt Mask.
  *            @arg BIT_SGPIO_CAPI_IM: Capture load event Interrupt Mask.
  *            @arg BIT_SGPIO_MUL_MR0I_IM: Multiple MR0 match Interrupt Mask.
  *            @arg BIT_SGPIO_RX_MR2I_IM: RX MR2 match Interrupt Mask.
  *            @arg BIT_SGPIO_RX_MR1I_IM: RX MR1 match Interrupt Mask.
  *            @arg BIT_SGPIO_RX_MR0I_IM: RX MR0 match Interrupt Mask.
  * @param  NewState: specifies the mask state of the interrupt.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_INTMask(SGPIO_TypeDef *SGPIOx, u32 SGPIO_IT, u32 NewState)
{
	u32 TempVal;

	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	TempVal = SGPIOx->SGPIO_IMR;

	if (NewState == ENABLE) {
		TempVal |= SGPIO_IT;
	} else {
		TempVal &= (~SGPIO_IT);
	}

	SGPIOx->SGPIO_IMR = TempVal;
}

/**
  * @brief  Get SGPIO Raw Interrupt Status.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @retval SGPIO raw interrupt status
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_MULMCNT_IS: MUL_MCNT counts to zero Interrupt Raw Status.
  *            @arg BIT_SGPIO_PATTERN_MATCH_IS: Matching pattern Interrupt Raw Status.
  *            @arg BIT_SGPIO_MULLOAD_IS: Loading multiple data Interrupt Raw Status.
  *            @arg BIT_SGPIO_RXLOAD_IS: Loading RX data Interrupt Raw Status.
  *            @arg BIT_SGPIO_MULSFT_IS: Multiple shift clock Interrupt Raw Status.
  *            @arg BIT_SGPIO_RXSFT_IS: RX shift clock Interrupt Raw Status.
  *            @arg BIT_SGPIO_CAPI_IS: Capture load event Interrupt Raw Status.
  *            @arg BIT_SGPIO_MUL_MR0I_IS: Multiple MR0 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR2I_IS: RX MR2 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR1I_IS: RX MR1 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR0I_IS: RX MR0 match Interrupt Raw Status.
  */
u32 SGPIO_GetRawINT(SGPIO_TypeDef *SGPIOx)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));
	
	return SGPIOx->SGPIO_ISR;
}

/**
  * @brief  clear SGPIO Interrupt Status.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_IT: SGPIO interrupt status to be cleared
  *          This parameter can be one or combinations of the following values:
  *            @arg BIT_SGPIO_MULMCNT_IS: MUL_MCNT counts to zero Interrupt Raw Status.
  *            @arg BIT_SGPIO_PATTERN_MATCH_IS: Matching pattern Interrupt Raw Status.
  *            @arg BIT_SGPIO_MULLOAD_IS: Loading multiple data Interrupt Raw Status.
  *            @arg BIT_SGPIO_RXLOAD_IS: Loading RX data Interrupt Raw Status.
  *            @arg BIT_SGPIO_MULSFT_IS: Multiple shift clock Interrupt Raw Status.
  *            @arg BIT_SGPIO_RXSFT_IS: RX shift clock Interrupt Raw Status.
  *            @arg BIT_SGPIO_CAPI_IS: Capture load event Interrupt Raw Status.
  *            @arg BIT_SGPIO_MUL_MR0I_IS: Multiple MR0 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR2I_IS: RX MR2 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR1I_IS: RX MR1 match Interrupt Raw Status.
  *            @arg BIT_SGPIO_RX_MR0I_IS: RX MR0 match Interrupt Raw Status.
  */
void SGPIO_ClearRawINT(SGPIO_TypeDef *SGPIOx, u32 SGPIO_IT)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	SGPIOx->SGPIO_ISR = SGPIO_IT;
}
/**
  * @brief  Enables or disables the SGPIO multiple match FIFO mode.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the multiple match FIFO mode. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_MULFIFO_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		/* Enable the SGPIO multiple match FIFO mode*/
		SGPIOx->SGPIO_MULMC_CTRL |= BIT_SGPIO_MUL_FMODE_EN;
	} else {
		/* Disable the SGPIO multiple match FIFO mode*/
		SGPIOx->SGPIO_MULMC_CTRL &= (~BIT_SGPIO_MUL_FMODE_EN);
	}
}

/**
  * @brief  Set SGPIO multiple match FIFO data.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  SGPIO_MULFIFOVal: new data to be pushed into multiple match FIFO. 
  * @retval None
  */
void SGPIO_MULFIFO_Set(SGPIO_TypeDef *SGPIOx, u32 SGPIO_MULFIFOVal)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	SGPIOx->SGPIO_MULFDATA = SGPIO_MULFIFOVal;
}

/**
  * @brief  Enables or disables the SGPIO multiple match DMA mode.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  NewState: new state of the multiple match FIFO mode. 
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SGPIO_MULDMA_Cmd(SGPIO_TypeDef *SGPIOx, u8 NewState)
{
	/* Check the parameters */
	assert_param(IS_SGPIO_ALL_PERIPH(SGPIOx));

	if (NewState != DISABLE) {
		/* Enable the SGPIO multiple match DMA mode*/
		SGPIOx->SGPIO_MULMC_CTRL |= BIT_SGPIO_MUL_DMA_EN;

		/* Trigger the SGPIO multiple match FIFO load with data for the first time*/
		SGPIOx->SGPIO_MULMC_CTRL |= BIT_SGPIO_MUL_DMA_START;
		while((1 == SGPIOx->SGPIO_MULMC_CTRL) & BIT_SGPIO_MUL_DMA_START);
	} else {
		/* Disable the SGPIO multiple match DMA mode*/
		SGPIOx->SGPIO_MULMC_CTRL &= (~BIT_SGPIO_MUL_DMA_EN);
	}
}

/**
  * @brief    Init and Enable SGPIO TX GDMA.
  * @param  SGPIOx: selected SGPIO peripheral.
  * @param  GDMA_InitStruct: pointer to a GDMA_InitTypeDef structure that contains 
  *         the configuration information for the GDMA peripheral.
  * @param  CallbackData: GDMA callback data.
  * @param  CallbackFunc: GDMA callback function.
  * @param  pTxBuf: Tx Buffer.
  * @param  TxCount: Tx Count.
  * @retval   TRUE/FLASE
  */
BOOL SGPIO_MULGDMA_Init(
	SGPIO_TypeDef *SGPIOx,
	GDMA_InitTypeDef *GDMA_InitStruct,
	void *CallbackData,
	IRQ_FUN CallbackFunc,
	u32 *pTxBuf,
	int TxCount
	)
{
	u8 GdmaChnl;

	assert_param(GDMA_InitStruct != NULL);

	GdmaChnl = GDMA_ChnlAlloc(0, (IRQ_FUN)CallbackFunc, (u32)CallbackData, 12);
	if (GdmaChnl == 0xFF) {
		/*  No Available DMA channel */
		return _FALSE;
	}	

	_memset((void *)GDMA_InitStruct, 0, sizeof(GDMA_InitTypeDef));

	GDMA_InitStruct->MuliBlockCunt     = 0;
	GDMA_InitStruct->MaxMuliBlock      = 1;

	GDMA_InitStruct->GDMA_DIR      = TTFCMemToPeri;
	GDMA_InitStruct->GDMA_DstHandshakeInterface = GDMA_HANDSHAKE_INTERFACE_SGPIO_TX;
	GDMA_InitStruct->GDMA_DstAddr = (u32)&(SGPIOx->SGPIO_MULFDATA);
	GDMA_InitStruct->GDMA_Index   = 0;
	GDMA_InitStruct->GDMA_ChNum       = GdmaChnl;
	GDMA_InitStruct->GDMA_IsrType = (TransferType|ErrType);

	GDMA_InitStruct->GDMA_DstMsize = MsizeFour;
	GDMA_InitStruct->GDMA_DstDataWidth = TrWidthTwoBytes;
	GDMA_InitStruct->GDMA_DstInc = NoChange;
	GDMA_InitStruct->GDMA_SrcInc = IncType;

	GDMA_InitStruct->GDMA_SrcMsize   = MsizeFour;
	GDMA_InitStruct->GDMA_SrcDataWidth = TrWidthTwoBytes;
	GDMA_InitStruct->GDMA_BlockSize = 4 * TxCount;

	assert_param(GDMA_InitStruct->GDMA_BlockSize <= 4096);

	GDMA_InitStruct->GDMA_SrcAddr = (u32)(pTxBuf);

	GDMA_Init(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, GDMA_InitStruct);
	GDMA_Cmd(GDMA_InitStruct->GDMA_Index, GDMA_InitStruct->GDMA_ChNum, ENABLE);

	return _TRUE;
}

/******************* (C) COPYRIGHT 2016 Realtek Semiconductor *****END OF FILE****/
